---
kind: other
id: Properties.T:Autodesk.Revit.DB.AssemblyCodeTable
source: html/c8dfe716-7cf3-a53e-8c64-0b2b3df74a91.htm
---
# AssemblyCodeTable Properties

The id of the assembly instance to which the element belongs.